Repository: msampaio/harpa
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: %s is not a number in base 3 between 0 and 2222222
pt_br: %s não é um número em base 3 entre 0 e 2222222

source: %s is not in prime form format
pt_br: %s não está no formato de forma prima

source: Settings index
pt_br: Índice de disposição

source: Insert an index number in base 3 between 0 and 2222222, such as 20102
pt_br: Insira um índice numérico em base 3 entre 0 e 2222222, como 20102

source: Settings Prime Form
pt_br: Forma prima da disposição

source: Insert a pcset prime form such as 02468A
pt_br: Insira uma forma prima de conjunto de classes de notas, tal como 02468A

source: Error
pt_br: Erro

source: Page not found.
pt_br: Página não encontrada.

source: Internal Server Error
pt_br: Erro Interno do Servidor

source: Home
pt_br: Página Principal

source: Dashboard
pt_br: Painel

source: About
pt_br: Sobre

source: Harp |
pt_br: Harpa |

source: Harp
pt_br: Harpa

source: This Webapp is part of a broader combinatorial and statistic study about the orchestral harp pedals, developed by Ricardo Bordini, Jamary Oliveira and Marcos da Silva Sampaio.
pt_br: Este aplicativo web é parte de um estudo combinatorial e estatístico mais amplo sobre os pedais da harpa orquestral, desenvolvido por Ricardo Bordini, Jamary Oliveira e Marcos da Silva Sampaio.

source: This page is under
pt_br: Esta página está sob

source: MIT license
pt_br: licença MIT

source: All settings
pt_br: Todas as disposições

source: Get by index
pt_br: Obter por índice

source: Get by prime form
pt_br: Obter por forma prima

source: Get by accidents
pt_br: Obter por acidentes

source: Get TXT file
pt_br: Obter arquivo TXT

source: Statistics
pt_br: Estatísticas

source: Pedal settings
pt_br: Disposição de pedais

source: The orchestral harp has 7 pedals, one for each pitch class. Each pedal has three possible positions: flat, natural or sharp. We call each permutation of these 7 pedals in the three positions <b>pedal settings</b>. There are 2187 possible pedal settings in the harp. We create a harp pedal settings index in a base 3 numeric system: 0, 1, 2, 10, 11, 12, 20, 21, 22, 100, 101, 102, etc.
pt_br: A harpa orquestral tem 7 pedais, um para cada classe de altura. Cada pedal tem três posições possíveis: bemol, natural ou sustenido. Nós chamamos cada permutação desses 7 pedais nas três posições de <b>disposições de pedais</b>. Existem 2187 disposições de pedais possíveis na harpa. Nós criamos um índice para as disposições de pedais da harpa em um sistema numérico de base 3: 0, 1, 2, 10, 11, 12, 20, 21, 22, 100, 101, 102, etc.

source: Queries
pt_br: Consultas

source: This app provides a full list with all pedal 2187 settings, a table to download, and four ways to query pedal settings:
pt_br: Este aplicativo fornece uma lista completa das 2187 disposições de pedais, uma tabela para download, e quatro formas de consulta de disposições de pedais:

source: by index
pt_br: por índice

source: by the resulting pitch set class prime form
pt_br: pela forma prima da classe de alturas resultante

source: by the pitch accidents
pt_br: pelos acidentes

source: These queries are available in the sidebar.
pt_br: Essas consultas estão disponíveis na guia lateral.

source: There are some statistics available, with sonority central tendency, chord type distribution, etc.
pt_br: Há alguns estudos estatístico disponíveis, com o estudo de tendência central de sonoridade, distribuição de tipos de acordes, etc.

source: Set the pedals settings:
pt_br: Defina as posições dos pedais:

source: Submit
pt_br: Enviar

source: Insert an index number in base 3 between 0 and 2222222...
pt_br: Insira um índice numérico em base 3 entre 0 e 2222222...

source: Insert a pcset prime form such as 02468A...
pt_br: Insira uma forma prima de conjunto de classes de notas, tal como 02468A

source: Harp Pedals is an application that returns the Harp's pedals settings and statistics.
pt_br: Harp Pedals é uma aplicação que retorna as disposições de pedais da Harpa e estatísticas.

source: Enter
pt_br: Entre

source: Developed by
pt_br: Desenvolvido por

source: and
pt_br: e

source: All pedal settings
pt_br: Todas as disposições de pedais

source: pedals settings
pt_br: disposições de pedais

source: Index
pt_br: Índice

source: Notes (scalar)
pt_br: Notas (escalar)

source: Notes (radial)
pt_br: Notas (radial)

source: PC Set
pt_br: Conjunto de classe de notas

source: Prime Form
pt_br: Forma prima

source: Forte Class
pt_br: Classe de Forte

source: Pedals Settings
pt_br: Disposição de pedais

source: MIDI file
pt_br: Arquivo MIDI

source: Pedal settings by type of chord
pt_br: Disposições de pedais por tipo de acorde

source: Each pedal setting can have enarmonies such as C# and Db. A pedal setting without enarmonies will result in a heptachord, with one enarmony will resul in a hexachord and so on.
pt_br: Cada disposição de pedais pode ter enarmonias tais como C# e Db. Uma disposição de pedais sem enarmonias resultará em um heptacorde, com uma enarmonia, resultará em um hexacorde, e assim por diante.

source: The table and pie chart below contain the number of pedal settings by chord type (tetrachord, pentacord, etc.).
pt_br: A tabela e o gráfico de torta abaixo contêm o número de disposições de pedais por tipo de acorde (tetracorde, pentacorde, etc.).

source: Chord type
pt_br: Tipo de acorde

source: chord
pt_br: corde

source: Pedal settings by prime form
pt_br: Disposições de pedais por forma prima

source: Each pedal setting results in a specific pitch class set, belonged to a pitch set class, represented by a prime form. Some pitch set classes can be obtained from multiple pedal settings, in a "one to many" relation type.
pt_br: Cada disposição de pedais resulta em um conjunto de classe de notas específico, pertencente a uma classe de conjunto de notas, representada por uma forma prima. Algumas classes de conjunto de notas podem ser obtidas a partir de múltiplas disposições de pedais, em um tipo de relação "um para muitos".

source: The histogram below contains the distribution of the pedal settings around the pitch set classes. Each square represents a pitch set class, each column represents a range of pedal settings. For instance, the first column contains all the set classes that can be obtained from 1 to 10 pedal settings.
pt_br: O histograma abaixo contém a distribuição das disposições de pedais em torno de classes de conjuntos de notas. Cada quadro representa uma classe de conjunto de notas, cada coluna representa uma faixa de número de disposições de pedais. Por exemplo, a primeira coluna contém todas as classes de conjuntos de notas que podem ser obtidas de 1 a 10 disposições de pedais.

source: Interval-class vector summation
pt_br: Soma de vetor classe-intervalar

source: Each pedal setting has a Interval-class vector, related to its pitch set class.
pt_br: Cada disposição de pedais tem um vetor classe-intervalar, relacionado à sua classe de conjunto de notas.

source: The table below contains the sum of the all pedal settings' the Interval-class vectors. The bar chart below contains the central tendency study, around intervals mean. Its Y axis contains the variation from the mean normalized by standard deviation.
pt_br: A tabela abaixo contém a soma dos vetores classe-intervalares de todas as disposições de pedais. O gráfico de barras abaixo contém o estudo de tendência central, em torno da média de intervalos. Seu eixo Y contém a variação a partir da média, normalizada pelo desvio padrão.

source: Interval (semitones)
pt_br: Intervalo (semitons)

source: Sum
pt_br: Soma

source: Pedal settings by chord type
pt_br: Disposições de pedais por tipo de acorde

source: Pedal settings grouped by Prime Form - Histogram
pt_br: Disposições dos pedais agrupadas pela forma prima - Histograma

source: Intervals amount central tendency
pt_br: Tendência central de quantidade de intervalos

source: Distance from the mean (normalized by standard deviation)
pt_br: Distância da média (normalizada por desvio padrão)

source: Amount
pt_br: Quantidade

source: Proportion
pt_br: Proporção

source: Number of Pitch Classes
pt_br: Número de classes de altura

source: Forte class
pt_br: Classe de Forte

source: Number of pedal settings
pt_br: Número de disposições de pedais

source: Interval
pt_br: Intervalo

source: ^about/$
pt_br: ^sobre/$

source: ^dashboard/$
pt_br: ^painel/$

source: ^dashboard/all/$
pt_br: ^painel/todas/$

source: ^dashboard/index$
pt_br: ^painel/indice$

source: ^dashboard/prime$
pt_br: ^painel/formaprima$

source: ^dashboard/accidents$
pt_br: ^painel/acidentes$

source: ^dashboard/index/(?P<pedal_index>\d+)/$
pt_br: ^painel/indice/(?P<pedal_index>\d+)/$

source: ^dashboard/prime/(?P<pedal_prime>\w+)/$
pt_br: ^painel/formaprima/(?P<pedal_prime>\w+)/$

source: ^dashboard/accidents/(?P<accidents>\w+)/$
pt_br: ^painel/acidentes/(?P<accidents>\w+)/$

source: ^dashboard/statistics/$
pt_br: ^painel/estatisticas/$
